/**
 * @description: 空列表背景图配置
 * @params SHOP_CLOSE 店铺打样
 * @params CART_EMPTY 购物车无
 * @params EVALUATION_EMPTY 无评价-无订单
 * @params NET_WORK_EMPTY 无网络
 * @params COUPON_EMPTY 无优惠券
 * @params COLLECTION_EMPTY 暂无收藏
 * @params MESSAGE_EMPTY 暂无消息
 */
export const EMPTY_GB = {
  SHOP_CLOSE: 'https://obs.xiaoqa.cn/gruul/20221209/66fe66e70f9d4be595df02da14e91ed4.png',
  CART_EMPTY: 'https://obs.xiaoqa.cn/gruul/20221209/24c17585304a41b0aacb6d0d3c797d06.png',
  EVALUATION_EMPTY: 'https://obs.xiaoqa.cn/gruul/20221209/1172dadcc01f483eb2aabad18509288e.png',
  NET_WORK: 'https://obs.xiaoqa.cn/gruul/20221209/e5cffa5c468f44a88a457aa79e729bec.png',
  COUPON_EMPTY: 'https://obs.xiaoqa.cn/gruul/20221209/1176d1cbf91c4cf4b0ee6ba789ac8fa4.png',
  COLLECTION_EMPTY: 'https://obs.xiaoqa.cn/gruul/20221209/c1619c6d8e7b4ede8cd8cc300c94454e.png',
  MESSAGE_EMPTY: 'https://obs.xiaoqa.cn/gruul/20221209/e7b4d78e16f04becb542296cd1b2da27.png',
} as const

export const REGEX = {
  DATE: /((\d{3}[1-9]|\d{2}[1-9]\d{1}|\d{1}[1-9]\d{2}|[1-9]\d{3})-(((0[13578]|1[02])-(0[1-9]|[12]\d|3[01]))|((0[469]|11)-(0[1-9]|[12]\d|30))|(02-(0[1-9]|[1]\d|2[0-8]))))|(((\d{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)((\d{3}[1-9]|\d{2}[1-9]\d{1}|\d{1}[1-9]\d{2}|[1-9]\d{3})-(((0[13578]|1[02])-(0[1-9]|[12]\d|3[01]))|((0[469]|11)-(0[1-9]|[12]\d|30))|(02-(0[1-9]|[1]\d|2[0-8]))))|(((\d{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)/,
  TIME: /\d{1,2}:\d{1,2}(:\d{1,2})?/,
  TIME_DATE:
    /((\d{3}[1-9]|\d{2}[1-9]\d{1}|\d{1}[1-9]\d{2}|[1-9]\d{3})-(((0[13578]|1[02])-(0[1-9]|[12]\d|3[01]))|((0[469]|11)-(0[1-9]|[12]\d|30))|(02-(0[1-9]|[1]\d|2[0-8]))))|(((\d{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)((\d{3}[1-9]|\d{2}[1-9]\d{1}|\d{1}[1-9]\d{2}|[1-9]\d{3})-(((0[13578]|1[02])-(0[1-9]|[12]\d|3[01]))|((0[469]|11)-(0[1-9]|[12]\d|30))|(02-(0[1-9]|[1]\d|2[0-8]))))|(((\d{2})(0[48]|[2468][048]|[13579][26])|((0[48]|[2468][048]|[3579][26])00))-02-29)\s\d{1,2}:\d{1,2}(:\d{1,2})?/,
  HTTP_URL: /^((https|http|ftp|rtsp|mms)?:\/\/)[^\s]+/,
  NUMBERS: /\d+/,
  BLANK: /[\s\S]*.*[^\s][\s\S]/,
  MOBILE: /(?:0|86|\+86)?1[3-9]\d{9}/,
  CITIZEN_ID: /[1-9]\d{5}[1-2]\d{3}((0\d)|(1[0-2]))(([012]\d)|3[0-1])\d{3}(\d|X|x)/,
  EMAIL: /^[a-zA-Z0-9.!#$%&'*+\/=?^_`{|}~-]+@[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]{0,61}[a-zA-Z0-9])?)*$/,
}
