package com.medusa.gruul.order.service;

import com.medusa.gruul.order.service.modules.printer.model.template.PrintFormat;
import org.junit.jupiter.api.Assertions;
import org.junit.jupiter.api.Test;

import java.util.List;

/**
 * @author 张治保
 * @since 2024/11/23
 */
public class PrintFormatTest {

    @Test
    void test() {
        String fxml = "#9 启山智软测试<BR>时装秀<BR>" +
                "--------------------------------<BR>" +
                "备注：2024-11-23<BR>" +
                "------------商品信息------------<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363606433792 韩国Y单restandrecreation春季新款针织衫R&R刺绣小标<BR>" +
                "                           x1 88<BR>" +
                "1860199363648376832 测试商品（同城多规格属性） (黑色,M,生菜:0.00,姜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "1860199363690319872 测试商品（同城多规格属性） (黑色,L,蒜:0.00)<BR>" +
                "                           x1 55<BR>" +
                "--------------------------------<BR>" +
                "商品数                        x3" +
                "商品金额                     198" +
                "运费                           0" +
                "平台优惠                       0" +
                "店铺优惠                    3.98" +
                "总优惠                      3.98" +
                "--------------------------------<BR>" +
                "实付                    ￥194.02<BR>" +
                "--------------------------------<BR>" +
                "订单编号：SS1860199363509272576<BR>" +
                "支付方式：余额<BR>" +
                "下单时间：2024-11-23 13:51:03<BR>" +
                "支付时间：2024-11-23 13:51:07<BR>" +
                "--------------------------------<BR>" +
                "测试超出范围<BR>" +
                "133****3333<BR>" +
                "北京市海淀区 池东路39号~什坊院1号院~39号楼一单元501<BR>" +
                "--------------------------------<BR>" +
                "<C><BC128_C>8723879827382359784975</BC128_C></C>" +
                "<C>条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形码下方说明条形</C><C>底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息底部信息</C>" +
                "<CUT>";
        List<String> splits = PrintFormat.printContentSplit(fxml);

        Assertions.assertEquals(
                fxml,
                String.join("", splits)
        );
    }
}
